demo/app/controllers/comments_controller.rb

INSERT INTO "comments" ("post_id", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["post_id", 4], ["content", "hola, que buen post!"], ["created_at", "2024-02-05 21:42:04.878415"], ["updated_at", "2024-02-05 21:42:04.878415"]]
---
    def create
      @post.comments.create! params.required(:comment).permit(:content)